{"duration": 3.7410738468170166, "input_args": {"transformer": "TfidfVectorizer(max_df=0.9, max_features=10000, min_df=2, ngram_range=(1, 3),\n                stop_words='english', sublinear_tf=True)", "X": "array([\"Radiosurgery for Arteriovenous Malformations and the Impact on Headaches. BACKGROUND: Arteriovenous malformation (AVMs) can underlie many diverse neurological sign and symptoms. Headaches are a common presentation that can have a significant impact on quality of life. OBJECTIVE: The author investigated Gamma Knife(®) stereotactic radiosurgery (SRS) outcome in patient with AVMs and associated headaches. METHODS: This retrospective study analyzed 102 patient with AVMs who underwent SRS between 1995 and 2013. The patient's headache symptom led to their AVM diagnosis or developed post hemorrhage of their AVM. Information regarding headache characteristic wa obtained from the patient's medical record and at follow-up using a scripted clinical interview. The median imaging follow-up wa 61.7 month and clinical follow-up wa 89.7 months. The median treatment volume at SRS wa 4.1 cm(3) and the median marginal dose wa 20 Gy. RESULTS: The actuarial AVM obliteration rate wa 60% at 5 year and 78% at 10 years. Patients reported that their overall headache severity decreased by -43.6% and their headache frequency wa reduced by -53.4%. Headache reduction wa reported in 49.1% of patient at 1 year and 69.5% at 5 years. The median time until improvement wa 6.5 months. After SRS, headache medication usage decreased in 29% of patients. Permanent adverse radiation effect after SRS occurred in 3% of patients. Until obliteration wa complete, the annual risk of a hemorrhage after SRS wa 0.4% per year. CONCLUSION: Although recall bias related to a retrospective analysis can impact outcomes, headache symptom associated with AVMs may potentially be decreased or eliminated in a subset of patient treated with Gamma Knife radiosurgery.\",\n       'Linear accelerator-based radiosurgery alone for arteriovenous malformation: more than 12 year of observation. PURPOSE: Although radiosurgery is an accepted treatment method for intracranial arteriovenous malformation (AVMs), it long-term therapeutic effect have not been sufficiently evaluated, and many report of long-term observation are from gamma-knife facilities. Furthermore, there are few reported result of treatment using only linear accelerator (LINAC)-based radiosurgery (LBRS). METHODS AND MATERIALS: Over a period of more than 12 years, we followed the long-term result of LBRS treatment performed in 51 AVM patients. RESULTS: The actuarial obliteration rates, after a single radiosurgery session, at 3, 5, 10, and 15 year were 46.9%, 54.0%, 64.4%, and 68.0%, respectively; when subsequent radiosurgeries were included, the rate were 46.9%, 61.3%, 74.2%, and 90.3%, respectively. Obliteration rate were significantly related to target volume ≥4 cm(3), marginal dos ≥12 Gy, Spetzler-Martin grade (1 v other), and AVM score ≥1.5; multivariate analysis revealed a significant difference for target volume ≥4 cm(3). The postprocedural actuarial symptomatic radiation injury rates, after a single radiation surgery session, at 5, 10, and 15 year were 12.3%, 16.8%, and 19.1%, respectively. Volumes ≥4 cm(3), location (lobular or other), AVM score ≥1.5, and the number of radiosurgery were related to radiation injury incidence; multivariate analysis revealed significant difference associated with volume ≥4 cm(3) and location (lobular or other). CONCLUSIONS: Positive result can be obtained with LBRS when performed with a target volume ≤4 cm(3), an AVM score ≤1.5, and ≥12 Gy radiation. Bleeding and radiation injury may appear even 10 year after treatment, necessitating long-term observation.',\n       'Pathological consideration to irradiation of cavernous malformations. Stereotactic radiosurgery is a controversial treatment modality in the management of cerebral cavernous malformation (CVMs). Systematic pathological study of irradiated specimen probably could help to resolve the controversy. Light microscopic investigation of a surgically resected thalamic CVM 1 year after 40-Gy irradiation revealed endothelial cell destruction in the cavernous channels, and marked fibrosis with scar tissue formation in the connective stroma of the lesion. These histopathological finding were similar to those described in arteriovenous malformation after Gamma Knife surgery, and suggest that the ionizing effect of radiation energy evokes vascular and connective tissue stroma change in CVMs a well.',\n       ...,\n       'Radiosurgical management of pediatric arteriovenous malformations. PURPOSE: Hemorrhage from an arteriovenous malformation (AVM) is the commonest cause of childhood stroke. Management option for child include observation and medical management, surgical resection, endovascular embolization, or stereotactic radiosurgery, alone or in combination. METHODS: Radiosurgery is used for high-risk malformation in critical brain locations. While this goal is being achieved, there should be limited morbidity and hopefully no mortality from hemorrhage or radiation-induced brain injury. RESULTS: Physicians who consider AVM radiosurgery cite one or more of the following: (1) that radiosurgery is an effective therapy required for the management of deep-brain AVMs; (2) that radiosurgery is an effective therapy for residual AVMs after subtotal resection; (3) that radiosurgery is worthwhile in an attempt to lower management risk for AVMs in functional brain locations; (4) since embolization doe not cure most AVMs, additional therapy such a radiosurgery may be required; and (5) microsurgical resection may not be the best choice for some children. CONCLUSION: Radiosurgery is the first and only biologic AVM therapy; it represents the beginning of future cellular approach to vascular malformation diseases. For this reason, the future of radiosurgery may be impacted positively by the development of other biologic strategy such a brain protection or endothelial sensitization.',\n       \"Image correlation of MRI and CT in treatment planning for radiosurgery of intracranial vascular malformations. Magnetic resonance imaging (MRI) ha been incorporated with stereotactic cerebral angiography and computed tomography (CT) in the treatment planning process of heavy ion radiosurgery of intracranial arteriovenous malformation (AVM's). Correlation of the image of the AVM and normal tissue on each of these neuroradiological imaging modality is achieved by mean of fiducial markers. The computerized transfer of angiographic information to the CT image regarding the size, shape, and location of the abnormal vasculature ha been described in an earlier report. A separate computer program calculates a fit between individual fiducial marker on the CT and MR image that enables the transfer of contour between the two imaging modalities. The MR image aid in the determination of the 3-dimensional shape of the AVM, adding to the information derived from the two angiographic projections. Currently, MRI cannot replace cerebral angiography in delineating the entire arterial phase of the AVM. Magnetic resonance imaging is invaluable in the treatment planning of angiographically-occult AVM's, determining the location, size, and shape of the volume to be treated. Correlation of the CT and MRI image allows for the transfer of CT-calculated isodose contour to the MRI image to aid in the determination of optimal treatment plans.\",\n       \"Theoretical study for use of Leksell's stereotactic frame in radiosurgery. The author examine all the problem connected with the use of Leksell's frame. These problem were studied specifically for the treatment of artero-venous malformation of the brain using small field and movement therapy of a 10 MV linear accelerator. The technique allows the administration of high radiation dos (25-30) Gy into a very small target within a fraction. In this way the surrounding tissue receives a low dose. The treatment wa initially simulated with a dummy. The dosimetry give an accuracy of +/- 1.5%. This study ha been able to resolve all the theoretical and practical problem demonstrating the feasibility of the project which ha already been put into effect.\"],\n      shape=(1392,), dtype=object)", "y": "551      True\n167      True\n1984    False\n236     False\n543     False\n        ...  \n786     False\n574     False\n324     False\n1695    False\n1518    False\nName: relevant, Length: 1392, dtype: bool", "weight": "None", "message_clsname": "'Pipeline'", "message": "None", "params": "{'fit': {}, 'partial_fit': {}, 'predict': {}, 'predict_proba': {}, 'predict_log_proba': {}, 'decision_function': {}, 'score': {}, 'split': {}, 'transform': {}, 'inverse_transform': {}, 'fit_transform': {}, 'fit_predict': {}, 'fit_resample': {}}"}, "time": 1746851092.6240695}