{"duration": 0.7709145545959473, "input_args": {"transformer": "TfidfVectorizer(max_features=10000, min_df=10, ngram_range=(1, 2),\n                stop_words='english', sublinear_tf=True)", "X": "array([\"Radiosurgery for Arteriovenous Malformations and the Impact on Headaches. BACKGROUND: Arteriovenous malformation (AVMs) can underlie many diverse neurological sign and symptoms. Headaches are a common presentation that can have a significant impact on quality of life. OBJECTIVE: The author investigated Gamma Knife(®) stereotactic radiosurgery (SRS) outcome in patient with AVMs and associated headaches. METHODS: This retrospective study analyzed 102 patient with AVMs who underwent SRS between 1995 and 2013. The patient's headache symptom led to their AVM diagnosis or developed post hemorrhage of their AVM. Information regarding headache characteristic wa obtained from the patient's medical record and at follow-up using a scripted clinical interview. The median imaging follow-up wa 61.7 month and clinical follow-up wa 89.7 months. The median treatment volume at SRS wa 4.1 cm(3) and the median marginal dose wa 20 Gy. RESULTS: The actuarial AVM obliteration rate wa 60% at 5 year and 78% at 10 years. Patients reported that their overall headache severity decreased by -43.6% and their headache frequency wa reduced by -53.4%. Headache reduction wa reported in 49.1% of patient at 1 year and 69.5% at 5 years. The median time until improvement wa 6.5 months. After SRS, headache medication usage decreased in 29% of patients. Permanent adverse radiation effect after SRS occurred in 3% of patients. Until obliteration wa complete, the annual risk of a hemorrhage after SRS wa 0.4% per year. CONCLUSION: Although recall bias related to a retrospective analysis can impact outcomes, headache symptom associated with AVMs may potentially be decreased or eliminated in a subset of patient treated with Gamma Knife radiosurgery.\",\n       'Linear accelerator-based radiosurgery alone for arteriovenous malformation: more than 12 year of observation. PURPOSE: Although radiosurgery is an accepted treatment method for intracranial arteriovenous malformation (AVMs), it long-term therapeutic effect have not been sufficiently evaluated, and many report of long-term observation are from gamma-knife facilities. Furthermore, there are few reported result of treatment using only linear accelerator (LINAC)-based radiosurgery (LBRS). METHODS AND MATERIALS: Over a period of more than 12 years, we followed the long-term result of LBRS treatment performed in 51 AVM patients. RESULTS: The actuarial obliteration rates, after a single radiosurgery session, at 3, 5, 10, and 15 year were 46.9%, 54.0%, 64.4%, and 68.0%, respectively; when subsequent radiosurgeries were included, the rate were 46.9%, 61.3%, 74.2%, and 90.3%, respectively. Obliteration rate were significantly related to target volume ≥4 cm(3), marginal dos ≥12 Gy, Spetzler-Martin grade (1 v other), and AVM score ≥1.5; multivariate analysis revealed a significant difference for target volume ≥4 cm(3). The postprocedural actuarial symptomatic radiation injury rates, after a single radiation surgery session, at 5, 10, and 15 year were 12.3%, 16.8%, and 19.1%, respectively. Volumes ≥4 cm(3), location (lobular or other), AVM score ≥1.5, and the number of radiosurgery were related to radiation injury incidence; multivariate analysis revealed significant difference associated with volume ≥4 cm(3) and location (lobular or other). CONCLUSIONS: Positive result can be obtained with LBRS when performed with a target volume ≤4 cm(3), an AVM score ≤1.5, and ≥12 Gy radiation. Bleeding and radiation injury may appear even 10 year after treatment, necessitating long-term observation.',\n       'Pathological consideration to irradiation of cavernous malformations. Stereotactic radiosurgery is a controversial treatment modality in the management of cerebral cavernous malformation (CVMs). Systematic pathological study of irradiated specimen probably could help to resolve the controversy. Light microscopic investigation of a surgically resected thalamic CVM 1 year after 40-Gy irradiation revealed endothelial cell destruction in the cavernous channels, and marked fibrosis with scar tissue formation in the connective stroma of the lesion. These histopathological finding were similar to those described in arteriovenous malformation after Gamma Knife surgery, and suggest that the ionizing effect of radiation energy evokes vascular and connective tissue stroma change in CVMs a well.',\n       ...,\n       'Prediction of result following Gamma Knife surgery for brain stem and other centrally located arteriovenous malformations: relation to natural course. Two model for predicting the result of Gamma Knife surgery for brain stem and other centrally located arteriovenous malformation (AVMs) are presented. By using these models, the probability of total obliteration and the risk of complication can be predicted. The model to predict the probability for obliteration is based on the following two observations. First, there is a positive relationship between the minimum dose given to the AVM nidus and the incidence of obliteration. Second, there is a negative relationship between the AVM nidus volume and the minimum dose given in the obliterated cases. The risk estimation model is also based on two observations. First, centrally located AVMs carry a higher risk of complication than those located peripherally. Second, the average dose to volume which are large for radiosurgery is related to the incidence of complications. The finding of this study may be used to estimate the consequence of Gamma Knife treatment for every individual case prior to the treatment. This make a comparison between different treatment option and no treatment possible. The risk of hemorrhage without any treatment is also quantified.',\n       'Virtual Planning and Augmented Reality-Guided Microsurgical Resection of a Frontal Arteriovenous Malformation. Arteriovenous malformation (AVMs) are complex vascular lesion that can pose significant risk for spontaneous hemorrhage, seizures, and symptom related to ischemia and venous hypertension.(1) Microsurgical management of AVMs requires a deep understanding of the surrounding anatomy and precise identification of the lesion characteristics. We demonstrate the use of augmented reality in the localization of arterial feeder and draining vein in relation to bordering normal structure (Video 1). A 66-year-old man presented with several episode of severe right frontal headaches. Magnetic resonance imaging revealed an AVM along the right frontal pole. Subsequent computed tomography angiography demonstrated arterial supply from the right anterior cerebral artery with venous drainage to the superior sagittal sinus. Due to the size, noneloquent location, and superficial pattern of venous drainage, the patient elected to proceed with microsurgery. A virtual planning platform wa used in preparation for surgery. Augmented reality integrated with neuronavigation wa used during microsurgical resection. Postoperative angiography showed complete resection of the AVM. The patient wa discharged home on postoperative day 3 with no complications. He remains neurologically well at 4 month of follow-up.',\n       'Delayed cyst formation after stereotactic radiosurgery for brain arteriovenous malformations. OBJECTIVE: Stereotactic radiosurgery (SRS) is a commonly employed treatment modality for brain arteriovenous malformation (AVMs). However, due to the low frequency of delayed cyst formation after AVM SRS, a well a the prolonged time interval between treatment and it occurrence, the characteristic of post-SRS cyst formation are not well defined. Therefore, the aim of this retrospective cohort study are to determine the rate of cyst formation after SRS for AVMs, identify predictive factors, and evaluate the clinical sequela of post-SRS cysts. METHODS: The author analyzed an SRS database for AVM patient who underwent SRS at the University of Virginia and identified those who developed post-SRS cysts. Statistical analysis were performed to determine predictor of post-SRS cyst formation and the effect of cyst formation on new or worsening seizure after SRS. RESULTS: The study cohort comprised 1159 AVM patient treated with SRS; cyst formation occurred in 17 patient (post-SRS cyst rate of 1.5%). Compared with patient who did not develop post-SRS cysts, those with cyst formation were treated with a greater number of radiosurgical isocenters (mean 3.8 v 2.8, p = 0.047), had a longer follow-up (mean 132 v 71 months, p < 0.001), were more likely to develop radiological radiation-induced change (RIC) (64.7% v 36.1%, p = 0.021), and had a longer duration of RIC (57 v 21 months, p < 0.001). A higher number of isocenters (p = 0.014), radiological RIC (p = 0.002), and longer follow-up (p = 0.034) were found to be independent predictor of post-SRS cyst formation in the multivariate analysis. There wa a trend toward a significant association between cyst formation and new or worsening seizure in univariate analysis (p = 0.054). CONCLUSIONS: Patients with greater nidal complexity appear to be more prone to post-SRS cyst formation. The finding of this study emphasize the importance of long-term follow-up for patient who have undergone AVM SRS, even after nidal obliteration is achieved. Post-SRS cyst may be epileptogenic, although seizure outcome after AVM SRS are multifactorial.'],\n      shape=(1391,), dtype=object)", "y": "551      True\n167      True\n1984    False\n236     False\n543     False\n        ...  \n386     False\n607     False\n1106    False\n1852    False\n1432    False\nName: relevant, Length: 1391, dtype: bool", "weight": "None", "message_clsname": "'Pipeline'", "message": "None", "params": "{'fit': {}, 'partial_fit': {}, 'predict': {}, 'predict_proba': {}, 'predict_log_proba': {}, 'decision_function': {}, 'score': {}, 'split': {}, 'transform': {}, 'inverse_transform': {}, 'fit_transform': {}, 'fit_predict': {}, 'fit_resample': {}}"}, "time": 1746852628.3489444}