{"duration": 3.112393379211426, "input_args": {"transformer": "TfidfVectorizer(max_df=0.9, max_features=5000, min_df=5, ngram_range=(1, 3),\n                stop_words='english', sublinear_tf=True)", "X": "array(['Stereotactic radiosurgical treatment of cerebral arteriovenous malformations. Gamma Unit Radiosurgery Study Group. OBJECTIVE: To assess the role of clinical factors, size of lesion, site of involvement, and radiation dose in patient with cerebral arteriovenous malformation (AVMs) who underwent stereotactic radiosurgical treatment. DESIGN: We reviewed the result in 121 patient with cerebral AVMs treated with the Leksell \"Gamma Knife\" between January 1990 and December 1993 at the Mayo Clinic in Rochester, Minnesota. MATERIAL AND METHODS: The following strict dose-volume protocol wa used: AVMs 2.0 cm or smaller in diameter (volume, 4.2 cm3 or less) received 20 Gy to the margin of the nidus, those between 2.1 and 3.0 cm in diameter (4.3 to 14.1 cm3) received 18 Gy to the margin, and those that exceeded 3.0 cm in diameter (more than 14.1 cm3) received 16 Gy to the margin. Lesions that involved the brain stem received a radiosurgical dose of 18 Gy or less to the margin. Patients participated in regular follow-up clinical and imaging study for up to 55 months. RESULTS: Follow-up cerebral angiography in 43 patient demonstrated total obliteration of the AVM nidus in 31 (72.1%), including 5 of 7 (71.4%) who had AVMs with a volume larger than 10 cm3. Clinical follow-up revealed that 111 patient (91.7%) had a stable or improved outcome, 3 had a nonfatal AVM hemorrhage, 2 suffered a fatal hemorrhage, and 2 died of cause not directly attributed to the AVM or radiosurgical treatment. Two patient had new or increased, nondisabling neurologic deficit a a result of treatment, and one patient had a temporary partial eyelid ptosis. CONCLUSION: Our finding suggest that previous theory about the relationship between AVM size and rate of obliteration after radiosurgical treatment may need revision. Our experience confirms that radiosurgical treatment for cerebral AVMs is safe and effective, even in case for which the latency period before obliteration is longer than 2 years.',\n       '[Retrospective analysis of failure in radiosurgery treatment of cerebral arteriovenous malformations]. The aim of this paper is to analyze retrospectively the reason for the failure in cerebral arteriovenous malformation radiosurgery. Several factor are evoked and discussed mainly: inaccurate target, intentional partial irradiation, repermeabilization of a previously embolized cerebral arteriovenous malformation. The result suggest the necessity of a complete irradiation of the nidus. The strategy of partial volume irradiation should be avoided, even if it necessitates lowering of the dos in large cerebral arteriovenous malformations. Accuracy in the target determination is required and a complete stereoangiography is necessary.',\n       \"Stereotactic radiosurgery. VIII. The classification of postradiation reactions. Postradiation reaction in the CNS are well described and catalogued in the conventional radiotherapy literature; acute, subacute and late CNS reaction are recognized. Tumours predispose to these normal tissue reaction by the oedema and pressure epiphenomenon that occur in their environs, and probably by other mechanism associated with tissue breakdown. That late normal tissue reaction (particularly permanent late sequelae--universally referred to a 'necrosis') occur in the normal nervous system is in the complication list of every radiosurgery centre. This article, for the first time, place postradiosurgery observation within or without the existing classification of reactions, and draw attention to the fact that previous 'radiosurgery risk factor' paper in the literature may be wrong to pool different 'reactions' in the formulation of risk formula for normal brain damage following single shot radiotherapy. Acute reaction occur in the same manner a described for conventional radiotherapy, being a transient swelling phenomenon that occurs 12-48 h after therapy; they are fully reversible and do not usually augur late problems; routine administration of short duration steroid around the time of radiosurgery may prevent or delay the clinical signs. Subacute reaction occur 3-10 month later (a later time than the subacute reaction following conventionally fractionated radiotherapy), and may prove fully or partially reversible, or progress to permanent sequelae; the difference between these and late sequela (which tend to be permanent themselves) then becomes blurred. That tumour swelling occurs in the subacute phase and is associated with oedema in the surrounding normal brain is an interesting observation (occurring in extra- and intra axial slow-growing tumours); it denotes tumour damage and ha not been encountered in the conventionally-fractionated radiotherapy literature. Tumour shrinkage occurs later, with subsidence of the surrounding oedema, and this phenomenon may therefore be regarded (paradoxically) a a good prognostic sign, a point about which the referring clinician should be made aware. Similarly, contrast enhancement in the tumour perimeter at this time reflects a host reactive response and not tumour activity. Persistent clinical neurological sign and MRI change (best seen on the T2 weighted sequences) beyond 2 years, indicate late damage or reaction. Usually, this represents scarring or coagulative necrosis without mass effect, but if there is a low signal area with mass effect and considerable surrounding oedema, liquefactive necrosis ha occurred and (as in the brachytherapy literature) surgical decompression is very occasionally needed.\",\n       ...,\n       'Prediction of result following Gamma Knife surgery for brain stem and other centrally located arteriovenous malformations: relation to natural course. Two model for predicting the result of Gamma Knife surgery for brain stem and other centrally located arteriovenous malformation (AVMs) are presented. By using these models, the probability of total obliteration and the risk of complication can be predicted. The model to predict the probability for obliteration is based on the following two observations. First, there is a positive relationship between the minimum dose given to the AVM nidus and the incidence of obliteration. Second, there is a negative relationship between the AVM nidus volume and the minimum dose given in the obliterated cases. The risk estimation model is also based on two observations. First, centrally located AVMs carry a higher risk of complication than those located peripherally. Second, the average dose to volume which are large for radiosurgery is related to the incidence of complications. The finding of this study may be used to estimate the consequence of Gamma Knife treatment for every individual case prior to the treatment. This make a comparison between different treatment option and no treatment possible. The risk of hemorrhage without any treatment is also quantified.',\n       'Virtual Planning and Augmented Reality-Guided Microsurgical Resection of a Frontal Arteriovenous Malformation. Arteriovenous malformation (AVMs) are complex vascular lesion that can pose significant risk for spontaneous hemorrhage, seizures, and symptom related to ischemia and venous hypertension.(1) Microsurgical management of AVMs requires a deep understanding of the surrounding anatomy and precise identification of the lesion characteristics. We demonstrate the use of augmented reality in the localization of arterial feeder and draining vein in relation to bordering normal structure (Video 1). A 66-year-old man presented with several episode of severe right frontal headaches. Magnetic resonance imaging revealed an AVM along the right frontal pole. Subsequent computed tomography angiography demonstrated arterial supply from the right anterior cerebral artery with venous drainage to the superior sagittal sinus. Due to the size, noneloquent location, and superficial pattern of venous drainage, the patient elected to proceed with microsurgery. A virtual planning platform wa used in preparation for surgery. Augmented reality integrated with neuronavigation wa used during microsurgical resection. Postoperative angiography showed complete resection of the AVM. The patient wa discharged home on postoperative day 3 with no complications. He remains neurologically well at 4 month of follow-up.',\n       'Delayed cyst formation after stereotactic radiosurgery for brain arteriovenous malformations. OBJECTIVE: Stereotactic radiosurgery (SRS) is a commonly employed treatment modality for brain arteriovenous malformation (AVMs). However, due to the low frequency of delayed cyst formation after AVM SRS, a well a the prolonged time interval between treatment and it occurrence, the characteristic of post-SRS cyst formation are not well defined. Therefore, the aim of this retrospective cohort study are to determine the rate of cyst formation after SRS for AVMs, identify predictive factors, and evaluate the clinical sequela of post-SRS cysts. METHODS: The author analyzed an SRS database for AVM patient who underwent SRS at the University of Virginia and identified those who developed post-SRS cysts. Statistical analysis were performed to determine predictor of post-SRS cyst formation and the effect of cyst formation on new or worsening seizure after SRS. RESULTS: The study cohort comprised 1159 AVM patient treated with SRS; cyst formation occurred in 17 patient (post-SRS cyst rate of 1.5%). Compared with patient who did not develop post-SRS cysts, those with cyst formation were treated with a greater number of radiosurgical isocenters (mean 3.8 v 2.8, p = 0.047), had a longer follow-up (mean 132 v 71 months, p < 0.001), were more likely to develop radiological radiation-induced change (RIC) (64.7% v 36.1%, p = 0.021), and had a longer duration of RIC (57 v 21 months, p < 0.001). A higher number of isocenters (p = 0.014), radiological RIC (p = 0.002), and longer follow-up (p = 0.034) were found to be independent predictor of post-SRS cyst formation in the multivariate analysis. There wa a trend toward a significant association between cyst formation and new or worsening seizure in univariate analysis (p = 0.054). CONCLUSIONS: Patients with greater nidal complexity appear to be more prone to post-SRS cyst formation. The finding of this study emphasize the importance of long-term follow-up for patient who have undergone AVM SRS, even after nidal obliteration is achieved. Post-SRS cyst may be epileptogenic, although seizure outcome after AVM SRS are multifactorial.'],\n      shape=(1391,), dtype=object)", "y": "362     False\n911     False\n832     False\n475     False\n1550    False\n        ...  \n386     False\n607     False\n1106    False\n1852    False\n1432    False\nName: relevant, Length: 1391, dtype: bool", "weight": "None", "message_clsname": "'Pipeline'", "message": "None", "params": "{'fit': {}, 'partial_fit': {}, 'predict': {}, 'predict_proba': {}, 'predict_log_proba': {}, 'decision_function': {}, 'score': {}, 'split': {}, 'transform': {}, 'inverse_transform': {}, 'fit_transform': {}, 'fit_predict': {}, 'fit_resample': {}}"}, "time": 1746851058.4294493}